# My personal set of brew packages i use with my setp

# SECTION 1) CLI tools
brew "zoxide"
brew "eza"
brew "bat"
brew "fd"
brew "dua-cli"
brew "bottom"
brew "lazygit"
brew "gh"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "yazi"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "gcc"

# SECTION 2) GUI applications
cask "kitty" 
cask "zed"
tap "d12frosted/emacs-plus"
brew "emacs-plus@30" 

# SECTION 3) Text editors
brew "neovim"

# SECTION 4) Programming languages and related utils (lsp and more)
brew "LLVM" # LLVM infra and tools
brew "lua" # lua runtime
brew "lua-language-server" # lua lsp
brew "stylua" # lua formatter
brew "python3" # python interpreter
brew "zig" # zig compiler
brew "zls" # zig language server
brew "odin" # odin compiler
brew "rustup" # rust infra
brew "ghcup" # haskell infra
brew "opam" # ocaml infra
brew "go" # go compiler and builtin tools
brew "gopls" # go lsp 
brew "meson"
brew "ninja"
brew "cmake"
brew "bazel"
brew "nasm"
brew "sdl3"
brew "racket"
brew "chezscheme"
brew "raylib"
brew "typst"


# SECTION 5) Fonts
cask "font-iosevka-nerd-font"

# SECTION 6) Window managers and other utils
cask "nikitabobko/tap/aerospace"
